$(function() {

    Morris.Area({
        element: 'morris-area-chart',
        data: [{
            "时间点": '2010 Q1',
            "草": 2666,
            "桦树": 1234.5,
            "松树": 2647
        }, {
            "时间点": '2010 Q2',
            "草": 889.9,
            "桦树": 123.6,
            "松树": 245.6
        }, {
            "时间点": '2010 Q3',
            "草": 344.5,
            "桦树": 453.78,
            "松树": 235.9
        }, {
            "时间点": '2011 Q4',
            "草": 123.7,
            "桦树": 1245.8,
            "松树": 12345.8
        }, {
            "时间点": '2011 Q1',
            "草": 3459.8,
            "桦树": null,
            "松树": 2647
        }, {
            "时间点": '2011 Q2',
            "草": 2666,
            "桦树": 3451.2,
            "松树": 2647
        }, {
            "时间点": '2012 Q3',
            "草": 3217.9,
            "桦树": 222.6,
            "松树": 3489
        }, {
            "时间点": '2012 Q4',
            "草": 4512.8,
            "桦树": 567.9,
            "松树": 2415
        }, {
            "时间点": '2012 Q1',
            "草": 2666,
            "桦树": 1112.98,
            "松树": 3579.78
        },
            {
                "时间点": '2013 Q1',
                "草": 4328.9,
                "桦树": 1111.11,
                "松树": 3218.4
            },
            {
                "时间点": '2013 Q1',
                "草": 4666,
                "桦树": null,
                "松树": 2647
            },
            {
                "时间点": '2013 Q1',
                "草": 1666,
                "桦树": 456.9,
                "松树": 2647
            },
            {
                "时间点": '2014 Q1',
                "草": 666,
                "桦树": 234.67,
                "松树": 2647
            },
            {
                "时间点": '2014 Q1',
                "草": 5666,
                "桦树": 1122.9,
                "松树": 2224.9
            },
            {
                "时间点": '2014 Q1',
                "草": 2234.9,
                "桦树": 222.78,
                "松树": 2647
            },
            {
                "时间点": '2015 Q1',
                "草": 3556.9,
                "桦树": 4445.9,
                "松树": 2647
            },
            {
                "时间点": '2015 Q1',
                "草": 5690.3,
                "桦树": null,
                "松树": 2647
            },{
                "时间点": '2015 Q2',
                "草": 452.3,
                "桦树": 1256.9,
                "松树": 4563
        }],
        xkey: '时间点',
        ykeys: ['草', '桦树', '松树'],
        labels: ['草', '桦树', '松树'],
        pointSize: 2,
        hideHover: 'auto',
        resize: true
    });

    Morris.Donut({
        element: 'morris-donut-chart',
        data: [{
            label: "爬行类动物(%)",
            value: 2.34
        },
            {
                label: "飞禽类动物(%)",
                value: 10
            },
            {
                label: "哺乳类动物(%)",
                value: 7.25
            },
            {
                label: "昆虫类动物(%)",
                value: 8.5
            },{
            label: "家禽类动物(%)",
            value: 30.12
        },
            {
                label: "食肉类动物(%)",
                value: 45.51
            },
            {
                label: "两栖类动物(%)",
                value: 10
            },{
            label: "鱼类动物(%)",
            value: 5
        }],
        resize: true
    });

    Morris.Bar({
        element: 'morris-bar-chart',
        data: [{
            y: '2006',
            a: 100,
            b: 90
        }, {
            y: '2007',
            a: 75,
            b: 65
        }, {
            y: '2008',
            a: 50,
            b: 40
        }, {
            y: '2009',
            a: 75,
            b: 65
        }, {
            y: '2010',
            a: 50,
            b: 40
        }, {
            y: '2011',
            a: 75,
            b: 65
        }, {
            y: '2012',
            a: 100,
            b: 90
        }],
        xkey: 'y',
        ykeys: ['a', 'b'],
        labels: ['Series A', 'Series B'],
        hideHover: 'auto',
        resize: true
    });

});
